## Today we are going to test your knowledge in SQL. Please refer to  http://www.w3schools.com/sql/ for any questions you might have over the material. Each question must be solved in only ONE SQL statement. No pandas or numpy operations may be used!
### These questions get progressively more difficult. Look through the website above and stackoverflow for hints on solving the more challenging problems. 
### Unfortunately, Brad will only be able to give help on questions with difficulty 7 and higher. He apologizes for the inconvenience.

#### First create a connection to your postgresql database here

In [1]:
from sqlalchemy import create_engine
import pandas as pd
engine = create_engine('postgres://mfnyeqfz:zxzi25vFYOiloQ8ORKUo2-Oog5GgfZc2@elmer.db.elephantsql.com:5432/mfnyeqfz')

pd.read_sql("SELECT * FROM information_schema.tables;", engine)[:3]

,table_catalog,table_schema,table_name,table_type,self_referencing_column_name,reference_generation,user_defined_type_catalog,user_defined_type_schema,user_defined_type_name,is_insertable_into,is_typed,commit_action
0,mfnyeqfz,public,pg_stat_statements,VIEW,None,None,None,None,None,NO,NO,None
1,mfnyeqfz,public,trump_tweets,BASE TABLE,None,None,None,None,None,YES,NO,None
2,mfnyeqfz,public,website_imdb,BASE TABLE,None,None,None,None,None,YES,NO,None

In [76]:
engine2 = create_engine('postgres://qsdtkqbo:mwPtZGaA3CdhC22_wn3P7xbSGFlRDvgJ@elmer.db.elephantsql.com:5432/qsdtkqbo')

In [79]:
engine3 = create_engine('postgres://xomkdtzk:XZHIEsUSaXQb9L_VlrAOEeYcuH5CB_h7@elmer.db.elephantsql.com:5432/xomkdtzk')

#### Let's use the "website_imdb" table for our queries

## Difficulty => 1

### Print out all the drama movies

In [2]:
pd.read_sql("SELECT * FROM website_imdb WHERE genre = 'Drama';", engine)[:3]

,id,title,poster,plot,genre,year,imdbRating,created,imdbID,awards,...,director,gross,imdbVotes,language,rated,released,response,runtime,type,writer
0,2740,Good Will Hunting,http://ia.media-imdb.com/images/M/MV5BMTk0NjY0...,"Will Hunting, a janitor at M.I.T., has a gift ...",Drama,1997,8.3,2016-11-13 22:22:15.411467+00:00,tt0119217,Won 2 Oscars. Another 20 wins & 53 nominations.,...,Gus Van Sant,138339411.0,609983,English,R,1998-01-09,True,126,movie,"Matt Damon, Ben Affleck"
1,2731,All About Eve,https://images-na.ssl-images-amazon.com/images...,An ingenue insinuates herself into the company...,Drama,1950,8.3,2016-11-13 22:22:15.409350+00:00,tt0042192,Won 6 Oscars. Another 16 wins & 17 nominations.,...,Joseph L. Mankiewicz,10177.0,84353,"English, French",APPROVED,1951-01-15,True,138,movie,Joseph L. Mankiewicz (written for the screen by)
2,2756,Fanny and Alexander,https://images-na.ssl-images-amazon.com/images...,Two young Swedish children experience the many...,Drama,1982,8.1,2016-11-13 22:22:15.415531+00:00,tt0083922,Won 4 Oscars. Another 19 wins & 10 nominations.,...,Ingmar Bergman,NaN,43998,"Swedish, German, Yiddish, English",R,1982-12-17,True,188,movie,Ingmar Bergman

### Print out all the movies with a director with 'C' or 'S' in their last names. Ignore any movies with multiple directors.

In [5]:
pd.read_sql("SELECT title, director FROM website_imdb WHERE (director LIKE '%% %%C%%' OR director LIKE '%% %%S%%') "
            "AND director NOT LIKE '%%,%%'", engine)[:3]

                     title          director
0        Good Will Hunting      Gus Van Sant
1                 Whiplash   Damien Chazelle
2  Raiders of the Lost Ark  Steven Spielberg

## Difficulty => 3

### Print out the gross of each director's highest grossing movie. Filter nan.

In [11]:
pd.read_sql("SELECT MAX(gross), director FROM website_imdb "
            "WHERE gross <> 'NaN' " 
            "GROUP BY director"
            , engine)[:3]

          max      director
0   6712241.0     Tony Kaye
1  23272306.0  Bryan Singer
2  44988180.0  Tom McCarthy

### Print out the gross of each director's highest grossing movie. Order by gross desc. Filter nan.

In [16]:
pd.read_sql("SELECT MAX(gross), director FROM website_imdb " 
            "WHERE gross <> 'NaN' "
            "GROUP BY director "
            "ORDER BY MAX(gross) DESC "
            ,engine)[:3]

           max           director
0  936627416.0        J.J. Abrams
1  533316061.0  Christopher Nolan
2  460935665.0       George Lucas

## Difficulty => 5

### Print out the movie title, gross, and director of each director's highest grossing movie. Order by gross desc. Filter nan.

In [19]:
# pd.read_sql(""
#             ,engine)[:3]

pd.read_sql("SELECT MAX(gross), director, title FROM website_imdb " 
            "WHERE gross <> 'NaN' "
            "GROUP BY director, title "
            "ORDER BY MAX(gross) DESC "
            ,engine)[:3]

           max           director                               title
0  936627416.0        J.J. Abrams        Star Wars: The Force Awakens
1  533316061.0  Christopher Nolan                     The Dark Knight
2  460935665.0       George Lucas  Star Wars: Episode IV - A New Hope

### Print out the movie title, rating, and director of each director's highest rated movie if that director has directed more than one movie. Order by rating desc. Filter nan.

In [67]:
pd.read_sql('SELECT imdb1."imdbRating", imdb1.director, imdb1.title '
            'FROM website_imdb AS imdb1, '
                '(SELECT director, MAX("imdbRating") AS max_r FROM website_imdb '
                    'WHERE "imdbRating" <> \'NaN\' '
                    'GROUP BY director '
                    'HAVING COUNT(director) > 1) AS imdb2 '
            'WHERE max_r = imdb1."imdbRating" AND imdb2.director = imdb1.director '
            'ORDER BY imdb1."imdbRating" DESC '
            ,engine)[:3]

   imdbRating              director                     title
0         9.3        Frank Darabont  The Shawshank Redemption
1         9.2  Francis Ford Coppola             The Godfather
2         9.0     Christopher Nolan           The Dark Knight

## Difficuty => 7

### Print out the released date, title, and the season (winter, spring, summer, fall) in which each movie was released. Let's assume for simplicity sake that seasons end at the end of each month instead of on the 21st.

In [87]:
# winter: 12,1,2
# spring: 3,4,5
# summer: 6,7,8
# Fall: 9, 10, 11

#This single, double quote stuff is super annoying.

pd.read_sql('SELECT released, title, '
                '( CASE '
                '  WHEN substring(released,6,2) in (\'12\', \'01\',\'02\') THEN \'winter\' '
                '  WHEN substring(released,6,2) in (\'03\', \'04\',\'05\') THEN \'spring\' '    
                '  WHEN substring(released,6,2) in (\'06\', \'07\',\'08\') THEN \'summer\' '
                '  ELSE \'Fall\' '
                '  END) AS season ' 
            'FROM website_imdb '
     , engine)[:5]


# for my engine with month column, broken for some reason.

# pd.read_sql('SELECT released, title, '
#                 '( CASE '
#                 '  WHEN date_part(\'month\', released) >= 12 AND date_part("month", released) <= 2 '
#                         'THEN "Winter" '
#                 '  WHEN date_part("month", released) BETWEEN 3 AND 5 '
#                         'THEN "Spring" '   
#                 '  WHEN date_part("month", released) BETWEEN 6 AND 8 '
#                         'THEN "Summer" ' 
#                 '  ELSE "Fall" '
#                 'END) AS season ' 
#             'FROM website_TopMovies '
#      , engine3)[:5]

     released                    title  season
0  1996-02-23                 La Haine  winter
1  1998-01-09        Good Will Hunting  winter
2  2014-10-15                 Whiplash    Fall
3  1956-11-19            Seven Samurai    Fall
4  1981-06-12  Raiders of the Lost Ark  summer

### Print out the released date, title, and the relation to today's date (disregard year). If the movie came out before today's month, print 'before' in the relationship column. If the movie came out after todays month, print out 'after' in the relationship column. If the movie was released in the same month, but not the same day, print out 'close'. If the movie came out on today's day and month print 'match'

In [104]:
pd.read_sql('SELECT released, title, '
                '( CASE '
                '  WHEN CAST(substring(released,6,2) as double precision) < EXTRACT(MONTH FROM current_date) THEN \'Before\' '
                '  WHEN CAST(substring(released,6,2) as double precision) > EXTRACT(MONTH FROM current_date) THEN \'After\' '   
                '  ELSE \'Close\' '
                '  END) AS relation ' 
            'FROM website_imdb WHERE released <> \'nan\' '
     , engine)[:5]

     released                    title relation
0  1996-02-23                 La Haine   Before
1  1998-01-09        Good Will Hunting   Before
2  2014-10-15                 Whiplash   Before
3  1956-11-19            Seven Samurai   Before
4  1981-06-12  Raiders of the Lost Ark   Before

## Difficulty => 9

### There is another table in my database called 'trump_tweets'. Print out all the times Trump has sent a tweet with a movie title in the text. The movie title must have a length greater than 1.

In [119]:
# Tried using subquery but that was harder.
pd.read_sql('SELECT trump_tweets.text, website_imdb.title '
            'FROM trump_tweets '
            'JOIN website_imdb ON trump_tweets.text ILIKE \'%%\' || website_imdb.title || \'%%\' ' 
            'WHERE LENGTH(website_imdb.title) > 1 ', engine )[:5]

                                                text        title
0  Another new poll. Thank you for your support! ...           Up
1  Great poll- Florida! Thank you! https://t.co/4...           Up
2  "@AshleyEdam: New CBS Poll shows defections fr...           Up
3  WOW, great new poll- New York! Thank you for y...           Up
4  Don't believe the @FoxNews Polls, they are jus...  The General

### Print out a movie if it is included in the following groups:
* Has the longest runtime
* Is created by the director who has the most imdbvotes
* Has been translated into more than 4 languages
* Has won 2 Oscars

### Make sure each movie is printed out at most one time!

In [136]:
# Wasn't sure if you meant all or nothing, so I went with included in "any" of these groups

pd.read_sql("SELECT title FROM website_imdb "
            "WHERE runtime = (SELECT MAX(runtime) FROM website_imdb) "
            "OR director IN (SELECT director from website_imdb "
                                'GROUP BY director ORDER BY SUM("imdbVotes") DESC '
                                "LIMIT 1) "
            "OR (LENGTH(language) - LENGTH(REPLACE(language,\',\',\'\'))) > 3 "
            "OR awards ILIKE '%%oscars%%' "
            , engine)[:5]

# SELECT (LENGTH(Col2) - LENGTH(REPLACE(Col2,",","")) + 1) AS MyCol2Count
# FROM MyTable

                          title
0             Good Will Hunting
1                      Whiplash
2                 Seven Samurai
3       Raiders of the Lost Ark
4  The Bridge on the River Kwai

## Good job on completing this assignment! You should now be ready for any SQL-based problem thrown at you in the future!

#### If you haven't finished the assignment, scroll back up. This message isn't for you.